yehudawe/AirCube/firmware/sdkconfig.defaults
#
# AirCube default build configuration
#

#
# Target chip
#
CONFIG_IDF_TARGET="esp32h2"

#
# Flash size (AirCube hardware has 2MB flash)
#
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"

#
# Custom partition table (includes zb_storage, zb_fct, and history partitions)
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_zigbee.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_zigbee.csv"

#
# Zigbee (required by firmware/main/zigbee.c)
#
CONFIG_ZB_ENABLED=y
# CONFIG_ZB_ZCZR is not set
CONFIG_ZB_ZED=y
# CONFIG_ZB_ZGPD is not set
CONFIG_ZB_RADIO_NATIVE=y
# CONFIG_ZB_RADIO_SPINEL_UART is not set
CONFIG_AIRCUBE_ZB_TX_POWER_DBM=20

#
# Bluetooth disabled — BLE BTHome is not used in production for now.
# Keeping the BT controller and software coexistence enabled made the
# 802.15.4 (Zigbee) radio arbitrate with an idle BT coex layer, hanging
# zigbee_main in the PHY frequency-set (wait_freq_set_busy). With BT off,
# Zigbee has exclusive radio access. Re-enable these (and ble_bthome.c in
# CMakeLists + the calls in main.c) to bring BLE back.
#
# CONFIG_BT_ENABLED is not set

#
# Radio coexistence disabled (only needed when BLE + Zigbee run together).
#
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set
